<template>
    <div class="faq">
        <div class="faq-title">
            FAQ
        </div>
        <faq-block v-for="QA in QAs" :question="QA.question" :answer="QA.answer"/>
    </div>
</template>

<script>
import faqBlock from "@/components/blocks/faq-block.vue";


export default {
  head: {
    title: 'Kleewish | FAQ'
  },
  data() {
    return {
        QAs: [
            {
                question: "За что вы получите бан в игре?",
                answer: "Одной из основных причин является использование читов и запрещенных программ. Использование сторонних программ или модификаций, которые дают игроку преимущество над другими, может привести к немедленному бану. \nМошенничество и хищение аккаунтов также являются серьезным нарушением, за которое игрок может быть забанен на долгий срок. Попытки взлома или хищения чужого аккаунта, а также обман других игроков с использованием поддельных предложений или сделок, являются неприемлемыми."
            },
            {
                question: "За что вы получите бан в игре?",
                answer: "Одной из основных причин является использование читов и запрещенных программ. Использование сторонних программ или модификаций, которые дают игроку преимущество над другими, может привести к немедленному бану. \nМошенничество и хищение аккаунтов также являются серьезным нарушением, за которое игрок может быть забанен на долгий срок. Попытки взлома или хищения чужого аккаунта, а также обман других игроков с использованием поддельных предложений или сделок, являются неприемлемыми."
            },
            {
                question: "За что вы получите бан в игре?",
                answer: "Одной из основных причин является использование читов и запрещенных программ. Использование сторонних программ или модификаций, которые дают игроку преимущество над другими, может привести к немедленному бану. \nМошенничество и хищение аккаунтов также являются серьезным нарушением, за которое игрок может быть забанен на долгий срок. Попытки взлома или хищения чужого аккаунта, а также обман других игроков с использованием поддельных предложений или сделок, являются неприемлемыми."
            },
        ]
    }
  },
  components: {faqBlock},
}
</script>

<style lang="scss" scoped>
.faq {
    display: flex;
    margin-top: 70px;
    flex-direction: column;
    align-items: center;
    width: 100%;
    gap: 10px;
    &-title {
        font-family: Gilroy;
        font-size: 46px;
        font-weight: 700;
        line-height: 57px;
        letter-spacing: 0em;
        text-align: center;
        width: fit-content;
        margin-bottom: 60px;
    }
}
</style>